result_probably_consolidated/xl170(broadwell)_not_consolidated_4core_4iothread_1/multiplier_2/run8.txt
# run=8/10
# 2026-04-06T00:47:27-06:00
# cmd: taskset -c 1-19 sysbench oltp_read_write --mysql-db=sbtest --tables=1 --table_size=100 --threads=32 --time=60 --rand-type=pareto run

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            838852
        write:                           218431
        other:                           112117
        total:                           1169400
    transactions:                        52199  (869.45 per sec.)
    queries:                             1169400 (19478.11 per sec.)
    ignored errors:                      7719   (128.57 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      869.4527
    time elapsed:                        60.0366s
    total number of events:              52199

Latency (ms):
         min:                                    2.58
         avg:                                   36.79
         max:                                  198.75
         95th percentile:                       77.19
         sum:                              1920474.58

Threads fairness:
    events (avg/stddev):           1631.2188/23.90
    execution time (avg/stddev):   60.0148/0.01